In [1]:
import numpy as np
import pandas as pd

In [8]:
ahmet = pd.DataFrame(data=["Ahmet","Cafer","Mehmet"], index=[1,2,3], columns=["Sıçış Gücü"])

In [10]:
ahmet

  Sıçış Gücü
1      Ahmet
2      Cafer
3     Mehmet

In [12]:
data = {'Name': ['John', 'Sarah', 'David', 'Emily'],
        'Age': [23, 25, 28, 21],
        'Gender': ['Male', 'Female', 'Male', 'Female']}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

    Name  Age  Gender
0   John   23    Male
1  Sarah   25  Female
2  David   28    Male
3  Emily   21  Female

In [15]:
df['Name']

0     John
1    Sarah
2    David
3    Emily
Name: Name, dtype: object

In [16]:
df.loc[1]

Name       Sarah
Age           25
Gender    Female
Name: 1, dtype: object

In [18]:
df.set_index('Name', inplace=True)

In [19]:
df

       Age  Gender
Name
John    23    Male
Sarah   25  Female
David   28    Male
Emily   21  Female

In [22]:
df.loc['John']

Age         23
Gender    Male
Name: John, dtype: object

In [23]:
df.sort_values(by='Age')

       Age  Gender
Name
Emily   21  Female
John    23    Male
Sarah   25  Female
David   28    Male

In [24]:
df['Age'].mean()

24.25

In [25]:
df['Age']

Name
John     23
Sarah    25
David    28
Emily    21
Name: Age, dtype: int64

In [27]:
df['Gender']

Name
John       Male
Sarah    Female
David      Male
Emily    Female
Name: Gender, dtype: object